src/Catalogs/ДанныеАвтозаполненияПлатежей/ДанныеАвтозаполненияПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДанныеАвтозаполненияПлатежей</name>
  <attributes>
    <name>КатегорияДвижения</name>
    <type>
      <types>EnumRef.КатегорииДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОперации</name>
    <type>
      <types>CatalogRef.КатегорииОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмВычисления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УправленческийУчет</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПараметра</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.РеквизитыУправленческогоУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмВычисления</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Необязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКОНХ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерНалоговой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнутренняяОрганизация</name>
    <comment>Организация-дубль контрагента</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИностранныйКонтрагент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/_РаботаСВыписками/Module.bsl
// ************************************
Функция СформироватьМассивПолейАвтопоиска()
	
	// Структура для автопоиска
	ПоляАвтоПоиска = Новый Массив;
	ПоляАвтоПоиска.Добавить("Ссылка");
	ПоляАвтоПоиска.Добавить("КатегорияДвижения");
	ПоляАвтоПоиска.Добавить("Организация");
	ПоляАвтоПоиска.Добавить("СчетОрганизации");
	ПоляАвтоПоиска.Добавить("Контрагент");
	ПоляАвтоПоиска.Добавить("СчетКонтрагента");
	ПоляАвтоПоиска.Добавить("НазначениеПлатежа");
	ПоляАвтоПоиска.Добавить("СтатьяДДС");
	
	Возврат ПоляАвтоПоиска;
	
КонецФункции

Функция СформироватьСтруктуруЗапросаАвтопоиска(СтруктураДанных) Экспорт
	
	ПоляАвтоПоиска = СформироватьМассивПолейАвтопоиска();
	СтруктураЗапроса = Новый Структура;
	
	Для Каждого Поле Из ПоляАвтоПоиска Цикл
		
		Если СтруктураДанных.Свойство(Поле) И ЗначениеЗаполнено(СтруктураДанных[Поле]) Тогда
			СтруктураЗапроса.Вставить(Поле, СтруктураДанных[Поле]);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураЗапроса;
	
КонецФункции

Функция НайтиДанныеАвтозаполнения(СтруктураПоиска) Экспорт
	
	ПоляАвтоПоиска = СформироватьМассивПолейАвтопоиска();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДанныеАвтозаполненияПлатежей.ШаблонНазначенияПлатежа КАК ШаблонНазначенияПлатежа,
	|	ДанныеАвтозаполненияПлатежей.Договор КАК Договор,
	|	ДанныеАвтозаполненияПлатежей.КатегорияОперации КАК КатегорияОперации,
	|	ВЫБОР
	|		КОГДА ДанныеАвтозаполненияПлатежей.ШаблонНазначенияПлатежа = """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сортировка,
	|	ДанныеАвтозаполненияПлатежей.УправленческийУчет.(
	|		Имя КАК Имя,
	|		Значение КАК Значение,
	|		АлгоритмВычисления КАК АлгоритмВычисления
	|	) КАК УправленческийУчет,
	|	ДанныеАвтозаполненияПлатежей.АлгоритмВычисления КАК АлгоритмВычисления,
	|	ДанныеАвтозаполненияПлатежей.СтатьяДДС КАК СтатьяДДС
	|ИЗ
	|	Справочник.ДанныеАвтозаполненияПлатежей КАК ДанныеАвтозаполненияПлатежей
	|ГДЕ
	|	НЕ ДанныеАвтозаполненияПлатежей.ПометкаУдаления
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сортировка");
	
	Для Каждого ПолеПоиска Из ПоляАвтоПоиска Цикл
	
		Если ПолеПоиска <> "НазначениеПлатежа" И СтруктураПоиска.Свойство(ПолеПоиска) Тогда
			
			Если ПолеПоиска = "Организация" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "1 = 1 И (Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) ИЛИ Организация = &Организация)");
			ИначеЕсли ПолеПоиска = "СчетОрганизации" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "1 = 1 И (СчетОрганизации = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) ИЛИ СчетОрганизации = &СчетОрганизации)");
			ИначеЕсли ПолеПоиска = "Контрагент" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "1 = 1 И (Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ИЛИ Контрагент = &Контрагент)");
			ИначеЕсли ПолеПоиска = "СчетКонтрагента" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "1 = 1 И (СчетКонтрагента = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка) ИЛИ СчетКонтрагента = &СчетКонтрагента)");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "1 = 1 И " + ПолеПоиска + " = &" + ПолеПоиска);
			КонецЕсли;
			
			Запрос.УстановитьПараметр(ПолеПоиска, СтруктураПоиска[ПолеПоиска]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ГлавныйРезультат = Запрос.Выполнить();
	ГлавнаяВыборка = ГлавныйРезультат.Выбрать();
	
	СтруктураВозврата = Новый Структура;
	Для Каждого КлючЗначение Из СтруктураПоиска Цикл
		СтруктураВозврата.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;
	
	RegExp = RegularExpressions.ПолучитьОбъектRegExp();
	RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске
	
	СтруктураУУ = Новый Структура;
	
	Пока ГлавнаяВыборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ГлавнаяВыборка.ШаблонНазначенияПлатежа) Тогда
			
			RegExp.Pattern = ГлавнаяВыборка.ШаблонНазначенияПлатежа;
			Matches = RegExp.Execute(СтруктураПоиска.НазначениеПлатежа);
		
			Если Matches.Count() <> 0 Тогда
			
				СтруктураВозврата.Вставить("Договор", ГлавнаяВыборка.Договор);
				СтруктураВозврата.Вставить("КатегорияОперации", ГлавнаяВыборка.КатегорияОперации);
				СтруктураВозврата.Вставить("СтатьяДДС", ГлавнаяВыборка.СтатьяДДС);
				
				Если ЗначениеЗаполнено(СокрЛП(ГлавнаяВыборка.АлгоритмВычисления)) Тогда
					Попытка
						Выполнить(ГлавнаяВыборка.АлгоритмВычисления);
					Исключение
						Сообщить(ИнформацияОбОшибке());
					КонецПопытки;
				КонецЕсли;
				
				ВыборкаПоУправленческомуУчету = ГлавнаяВыборка.УправленческийУчет.Выбрать();
				Пока ВыборкаПоУправленческомуУчету.Следующий() Цикл
					
					Имя = ВыборкаПоУправленческомуУчету.Имя;
					Значение = ВыборкаПоУправленческомуУчету.Значение;
					НазначениеПлатежа = СтруктураПоиска.НазначениеПлатежа;
					
					Если ЗначениеЗаполнено(ВыборкаПоУправленческомуУчету.АлгоритмВычисления) Тогда
						Попытка
							Выполнить(ВыборкаПоУправленческомуУчету.АлгоритмВычисления);
						Исключение
							Сообщить(ИнформацияОбОшибке());
						КонецПопытки;
					КонецЕсли;
					
					СтруктураУУ.Вставить(Имя, Значение);
					
				КонецЦикла;
				
				Прервать;
			
			КонецЕсли;
			
		Иначе
			
			СтруктураВозврата.Вставить("Договор", ГлавнаяВыборка.Договор);
			СтруктураВозврата.Вставить("КатегорияОперации", ГлавнаяВыборка.КатегорияОперации);
			
			Если ЗначениеЗаполнено(СокрЛП(ГлавнаяВыборка.АлгоритмВычисления)) Тогда
				Попытка
					Выполнить(ГлавнаяВыборка.АлгоритмВычисления);
				Исключение
					Сообщить(ИнформацияОбОшибке());
				КонецПопытки;
			КонецЕсли;
			
			ВыборкаПоУправленческомуУчету = ГлавнаяВыборка.УправленческийУчет.Выбрать();
			Пока ВыборкаПоУправленческомуУчету.Следующий() Цикл
				
				Имя = ВыборкаПоУправленческомуУчету.Имя;
				Значение = ВыборкаПоУправленческомуУчету.Значение;
				НазначениеПлатежа = СтруктураПоиска.НазначениеПлатежа;
				
				Если ЗначениеЗаполнено(ВыборкаПоУправленческомуУчету.АлгоритмВычисления) Тогда
					Попытка
						Выполнить(ВыборкаПоУправленческомуУчету.АлгоритмВычисления);
					Исключение
						Сообщить(ИнформацияОбОшибке());
					КонецПопытки;
				КонецЕсли;
				
				СтруктураУУ.Вставить(Имя, Значение);
				
			КонецЦикла;
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ДанныеУправленческогоУчета", СтруктураУУ);
	
	Возврат СтруктураВозврата;
	
КонецФункции
